InformationRegisters/МакетыЭлектронныхКурсов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>МакетыЭлектронныхКурсов</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Макет</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ДатаОбновления</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Язык</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ЯзыкиИнтерфейсаЭлектронныхКурсов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Тема</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТемыОформленияЭлектронныхКурсов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/НастройкиЭлектронныхКурсов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>НастройкиЭлектронныхКурсов</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>РазработчикКурсов</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПоставщикиЭлектронныхКурсов</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ИзменятьТолькоСвоиКурсы</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ШиринаВидеоПоУмолчанию</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>4</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЯзыкИнтерфейса</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ЯзыкиИнтерфейсаЭлектронныхКурсов</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТемаОформления</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТемыОформленияЭлектронныхКурсов</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПоказыватьСлужебныеЭлектронныеКурсы</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/ОбщиеНастройкиЭлектронногоОбучения.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>ОбщиеНастройкиЭлектронногоОбучения</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>АдресОбщегоКаталогаНаВебСервере</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПутьКОбщемуКаталогуНаВебСервере</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ИспользоватьОбщийКаталогВТонкомКлиенте</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ФормироватьВОбщемКаталогеМанифестCMI5</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Catalogs/ЭлементыЭлектронныхРесурсов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Catalog>
		<Properties>
			<Name>ЭлементыЭлектронныхРесурсов</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
			<Owners>
				<xr:Item>Catalog.ЭлектронныеРесурсы</xr:Item>
			</Owners>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Высота</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаИзменения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИмяФайла</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1024</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Поставщик</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПоставщикиЭлектронныхКурсов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Тип</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыЭлементовЭлектронныхРесурсов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ширина</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПроигрыватьАвтоматически</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЭтоВнешнийЭлемент</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Описание</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ДанныеЭлемента</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>КодДанных</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>36</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ХранилищеДанных</Name>
							<Type>
								<v8:Type>v8:ValueStorage</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПрисоединенныйФайл</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ЭлементыЭлектронныхРесурсовПрисоединенныеФайлы</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДанныеОбмена</Name>
							<Type>
								<v8:Type>v8:ValueStorage</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Расширение</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>10</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДанныеДляИндексирования</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Гиперссылки</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ЭлементСодержания</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СодержаниеЭлектронныхКурсов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Страница</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СтраницыЭлементовЭлектронныхКурсов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Адрес</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

CommonModules/ОбновлениеИнформационнойБазыБЭО/Ext/Module.bsl
////////////////////////////////////////////////////////////////////////////////
// Обновление информационной базы библиотеки электронного обучения.
//
////////////////////////////////////////////////////////////////////////////////

#Область ПрограммныйИнтерфейс

////////////////////////////////////////////////////////////////////////////////
// Сведения о библиотеке (или конфигурации).

// Заполняет основные сведения о библиотеке или основной конфигурации.
// Библиотека, имя которой имя совпадает с именем конфигурации в метаданных, определяется как основная конфигурация.
// 
// Параметры:
//  Описание - Структура - сведения о библиотеке:
//
//   * Имя                 - Строка - имя библиотеки, например, "СтандартныеПодсистемы".
//   * Версия              - Строка - версия в формате из 4-х цифр, например, "2.1.3.1".
//
//   * ТребуемыеПодсистемы - Массив - имена других библиотек (Строка), от которых зависит данная библиотека.
//                                    Обработчики обновления таких библиотек должны быть вызваны ранее
//                                    обработчиков обновления данной библиотеки.
//                                    При циклических зависимостях или, напротив, отсутствии каких-либо зависимостей,
//                                    порядок вызова обработчиков обновления определяется порядком добавления модулей
//                                    в процедуре ПриДобавленииПодсистем общего модуля
//                                    ПодсистемыКонфигурацииПереопределяемый.
//   * РежимВыполненияОтложенныхОбработчиков - Строка - "Последовательно" - отложенные обработчики обновления выполняются
//                                    последовательно в интервале от номера версии информационной базы до номера
//                                    версии конфигурации включительно или "Параллельно" - отложенный обработчик после
//                                    обработки первой порции данных передает управление следующему обработчику, а после
//                                    выполнения последнего обработчика цикл повторяется заново.
//
Процедура ПриДобавленииПодсистемы(Описание) Экспорт
	
	Описание.Имя    = "БиблиотекаЭлектронногоОбучения";
	Описание.Версия = "4.0.1.34";
	
	// ВАЖНО! При изменении поставляемых макетов обязательно:
	// 1. Поменять версии обработчиков обновления ниже.
	// 2. Поменять дату в функции ДатаИзмененияПоставляемыхМакетов.
	
	Описание.ТребуемыеПодсистемы.Добавить("СтандартныеПодсистемы");	
	
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// Обработчики обновления информационной базы.

// Добавляет процедуры-обработчики обновления, необходимые данной подсистеме.
//
// Параметры:
//  Обработчики - ТаблицаЗначений - см. описание функции НоваяТаблицаОбработчиковОбновления
//                                  общего модуля ОбновлениеИнформационнойБазы.
// 
Процедура ПриДобавленииОбработчиковОбновления(Обработчики) Экспорт
	
	// Начальное заполнение
		
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "";
	Обработчик.РежимВыполнения = "Оперативно";
	Обработчик.НачальноеЗаполнение = Истина;
	Обработчик.Процедура = "ОбновлениеИнформационнойБазыБЭО.ЗаполнитьРазделенныеДанные";				
	
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "";
	Обработчик.НачальноеЗаполнение = Истина;
	Обработчик.Процедура = "ОбновлениеИнформационнойБазыБЭО.ЗаполнитьОбщиеПоставляемыеДанные";
	Обработчик.ОбщиеДанные = Истина;
	Обработчик.МонопольныйРежим = Ложь;	
	
	// Обновления общие
	
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = ВерсияОбработчика("4.0.1.34");
	Обработчик.РежимВыполнения = "Оперативно";
	Обработчик.Процедура = "ОбновлениеИнформационнойБазыБЭО.ЗаполнитьРазделенныеДанные";				
	
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = ВерсияОбработчика("4.0.1.34");
	Обработчик.Процедура = "ОбновлениеИнформационнойБазыБЭО.ЗаполнитьОбщиеПоставляемыеДанные";
	Обработчик.ОбщиеДанные = Истина;	
	Обработчик.МонопольныйРежим = Ложь;
	
	// Обновления до версии
	
	Если Метаданные.ОбщиеМодули.Найти("ОбновлениеИнформационнойБазыРедакции31БЭО") <> Неопределено Тогда
	
		Обработчик = Обработчики.Добавить();
		Обработчик.Версия = ВерсияОбработчика("3.2.1.1");
		Обработчик.РежимВыполнения = "Оперативно";
		Обработчик.Процедура = "ОбновлениеИнформационнойБазыРедакции31БЭО.ВыполнитьОбновлениеСРедакции31ДоРедакции32";
		
	КонецЕсли;
		
КонецПроцедуры

// Вызывается перед процедурами-обработчиками обновления данных ИБ.
//
Процедура ПередОбновлениемИнформационнойБазы() Экспорт
	
		
КонецПроцедуры

// Вызывается после завершения обновления данных ИБ.
// 
// Параметры:
//   ПредыдущаяВерсия       - Строка - версия до обновления. "0.0.0.0" для "пустой" ИБ.
//   ТекущаяВерсия          - Строка - версия после обновления.
//   ВыполненныеОбработчики - ДеревоЗначений - список выполненных процедур-обработчиков обновления,
//                                             сгруппированных по номеру версии.
//   ВыводитьОписаниеОбновлений - Булево - если установить Истина, то будет выведена форма
//                                с описанием обновлений. По умолчанию, Истина.
//                                Возвращаемое значение.
//   МонопольныйРежим           - Булево - Истина, если обновление выполнялось в монопольном режиме.
//
//
Процедура ПослеОбновленияИнформационнойБазы(Знач ПредыдущаяВерсия, Знач ТекущаяВерсия,
		Знач ВыполненныеОбработчики, ВыводитьОписаниеОбновлений, МонопольныйРежим) Экспорт
	
		
КонецПроцедуры

// Вызывается при подготовке табличного документа с описанием изменений в программе.
//
// Параметры:
//   Макет - ТабличныйДокумент - описание обновления всех библиотек и конфигурации.
//           Макет можно дополнить или заменить.
//           См. также общий макет ОписаниеИзмененийСистемы.
//
Процедура ПриПодготовкеМакетаОписанияОбновлений(Знач Макет) Экспорт
	
КонецПроцедуры

// Позволяет переопределить режим обновления данных информационной базы.
// Для использования в редких (нештатных) случаях перехода, не предусмотренных в
// стандартной процедуре определения режима обновления.
//
// Параметры:
//   РежимОбновленияДанных - Строка - в обработчике можно присвоить одно из значений:
//              "НачальноеЗаполнение"     - если это первый запуск пустой базы (области данных);
//              "ОбновлениеВерсии"        - если выполняется первый запуск после обновление конфигурации базы данных;
//              "ПереходСДругойПрограммы" - если выполняется первый запуск после обновление конфигурации базы данных, 
//                                          в которой изменилось имя основной конфигурации.
//
//   СтандартнаяОбработка  - Булево - если присвоить Ложь, то стандартная процедура
//                                    определения режима обновления не выполняется, 
//                                    а используется значение РежимОбновленияДанных.
//
Процедура ПриОпределенииРежимаОбновленияДанных(РежимОбновленияДанных, СтандартнаяОбработка) Экспорт
	
КонецПроцедуры

// Добавляет в список процедуры-обработчики перехода с другой программы (с другим именем конфигурации).
// Например, для перехода между разными, но родственными конфигурациями: базовая -> проф -> корп.
// Вызывается перед началом обновления данных ИБ.
//
// Параметры:
//  Обработчики - ТаблицаЗначений - с колонками:
//    * ПредыдущееИмяКонфигурации - Строка - имя конфигурации, с которой выполняется переход;
//                                           или "*", если нужно выполнять при переходе с любой конфигурации.
//    * Процедура                 - Строка - полное имя процедуры-обработчика перехода с программы
//                                           ПредыдущееИмяКонфигурации.
//                                  Например, "ОбновлениеИнформационнойБазыУПП.ЗаполнитьУчетнуюПолитику"
//                                  Обязательно должна быть экспортной.
//
// Пример:
//  Обработчик = Обработчики.Добавить();
//  Обработчик.ПредыдущееИмяКонфигурации  = "УправлениеТорговлей";
//  Обработчик.Процедура                  = "ОбновлениеИнформационнойБазыУПП.ЗаполнитьУчетнуюПолитику";
//
Процедура ПриДобавленииОбработчиковПереходаСДругойПрограммы(Обработчики) Экспорт
	
КонецПроцедуры

// Вызывается после выполнения всех процедур-обработчиков перехода с другой программы (с другим именем конфигурации),
// и до начала выполнения обновления данных ИБ.
//
// Параметры:
//  ПредыдущееИмяКонфигурации    - Строка - имя конфигурации до перехода.
//  ПредыдущаяВерсияКонфигурации - Строка - имя предыдущей конфигурации (до перехода).
//  Параметры                    - Структура - 
//    * ВыполнитьОбновлениеСВерсии   - Булево - по умолчанию Истина. Если установить Ложь, 
//        то будут выполнена только обязательные обработчики обновления (с версией "*").
//    * ВерсияКонфигурации           - Строка - номер версии после перехода. 
//        По умолчанию, равен значению версии конфигурации в свойствах метаданных.
//        Для того чтобы выполнить, например, все обработчики обновления с версии ПредыдущаяВерсияКонфигурации, 
//        следует установить значение параметра в ПредыдущаяВерсияКонфигурации.
//        Для того чтобы выполнить вообще все обработчики обновления, установить значение "0.0.0.1".
//    * ОчиститьСведенияОПредыдущейКонфигурации - Булево - по умолчанию Истина. 
//        Для случаев когда предыдущая конфигурация совпадает по имени с подсистемой текущей конфигурации, следует
//        указать Ложь.
//
Процедура ПриЗавершенииПереходаСДругойПрограммы(ПредыдущееИмяКонфигурации, ПредыдущаяВерсияКонфигурации, Параметры) Экспорт
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Хранит дату изменения макетов ПоставляемыеФайлыЭлектронныхКурсов
// и ПоставляемыеШаблоныЭлектронныхКурсов
//
// Возвращаемое значение:
//  Дата - Дата изменения поставляемых шаблонов.
//
Функция ДатаИзмененияПоставляемыхМакетов() Экспорт	
	Возврат ИзучениеЭлектронныхКурсовСлужебныйКлиентСервер.ДатаИзмененияМакетов();	
КонецФункции

Процедура ЗаполнитьОбщиеПоставляемыеДанные() Экспорт
	
	// Заполняем макеты курсов
	//
	
	// Распаковываем макеты
	
	ФайлыДляУдаления = Новый Массив;	
	
	ПутьКАрхивуСМакетами = ПолучитьИмяВременногоФайла("zip");
	ФайлыДляУдаления.Добавить(ПутьКАрхивуСМакетами);
	
	ДанныеАрхиваСМакетами = ПолучитьОбщийМакет("ПоставляемыеМакетыЭлектронныхКурсов");
	ДанныеАрхиваСМакетами.Записать(ПутьКАрхивуСМакетами);	
	
	ПутьКМакетам = ПолучитьИмяВременногоФайла("");
	ЭлектронноеОбучениеСлужебныйКлиентСервер.НовыйКаталог(ПутьКМакетам);
	ФайлыДляУдаления.Добавить(ПутьКМакетам);
	
	Архиватор = Новый ЧтениеZipФайла(ПутьКАрхивуСМакетами);
	Архиватор.ИзвлечьВсе(ПутьКМакетам, РежимВосстановленияПутейФайловZIP.Восстанавливать);
	Архиватор.Закрыть();
	
	НачатьТранзакцию();
	
	Попытка
		
		// Блокируем весь регистр
		
		БлокировкаДанных = Новый БлокировкаДанных;
		ЭлементБлокировкиДанных = БлокировкаДанных.Добавить("РегистрСведений.МакетыЭлектронныхКурсов");
		ЭлементБлокировкиДанных.Режим = РежимБлокировкиДанных.Исключительный;
		БлокировкаДанных.Заблокировать();
		
		// Очищаем регистр с макетами
		
		НаборЗаписей = РегистрыСведений.МакетыЭлектронныхКурсов.СоздатьНаборЗаписей();
		НаборЗаписей.Записать();
		
		// Записываем новые макеты
		
		КоличествоЗагруженных = 0;
		КоличествоНеЗагруженных = 0;
		
		Для каждого Язык Из Перечисления.ЯзыкиИнтерфейсаЭлектронныхКурсов Цикл
		
			КороткийКодЯзыка = Перечисления.ЯзыкиИнтерфейсаЭлектронныхКурсов.ПростойКодИзСоставного(Язык);
			
			Для каждого Тема Из Перечисления.ТемыОформленияЭлектронныхКурсов Цикл
			
				КодТемы = Перечисления.ТемыОформленияЭлектронныхКурсов.КодТемы(Тема);
				
				ПутьКМакету = ЭлектронноеОбучениеСлужебныйКлиентСервер.ДобавитьКонечныйРазделительПути(ПутьКМакетам) + КороткийКодЯзыка;
				ПутьКМакету = ЭлектронноеОбучениеСлужебныйКлиентСервер.ДобавитьКонечныйРазделительПути(ПутьКМакету) + КодТемы;
				
				КаталогМакета = Новый Файл(ПутьКМакету);
				
				Если НЕ КаталогМакета.Существует() Тогда
					КоличествоНеЗагруженных = КоличествоНеЗагруженных + 1;
					Продолжить;
				КонецЕсли;
				
				ПутьКМакету = ЭлектронноеОбучениеСлужебныйКлиентСервер.ДобавитьКонечныйРазделительПути(ПутьКМакету);
				
				ПутьКАрхивуСМакетом = ПолучитьИмяВременногоФайла("zip");
				ФайлыДляУдаления.Добавить(ПутьКАрхивуСМакетом);
				
				Архиватор = Новый ЗаписьZipФайла(ПутьКАрхивуСМакетом,,,, УровеньСжатияZIP.Минимальный);
				Архиватор.Добавить(ПутьКМакету + "*", РежимСохраненияПутейZIP.СохранятьОтносительныеПути, РежимОбработкиПодкаталоговZIP.ОбрабатыватьРекурсивно);
				Архиватор.Записать();
				
				ЗаписьРегистра = РегистрыСведений.МакетыЭлектронныхКурсов.СоздатьМенеджерЗаписи();
				ЗаписьРегистра.Язык = Язык;
				ЗаписьРегистра.Тема = Тема;
				ЗаписьРегистра.Макет = Новый ХранилищеЗначения(Новый ДвоичныеДанные(ПутьКАрхивуСМакетом));
				ЗаписьРегистра.ДатаОбновления = ТекущаяДатаСеанса();
				ЗаписьРегистра.Записать();
				
				КоличествоЗагруженных = КоличествоЗагруженных + 1;
				
			КонецЦикла;
		
		КонецЦикла;
		
		ЗафиксироватьТранзакцию();
		
	Исключение
		
		ОтменитьТранзакцию();
		ЭлектронноеОбучениеСлужебный.ЗаписатьОшибкуВЖурналРегистрации(ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
		ВызватьИсключение;
		
	КонецПопытки;	
	
	// Удаляем временные файлы
	
	Для каждого ПутьКФайлу Из ФайлыДляУдаления Цикл
	
		Попытка
			УдалитьФайлы(ПутьКФайлу);
		Исключение
			ЭлектронноеОбучениеСлужебный.ЗаписатьОшибкуВЖурналРегистрации(НСтр("ru = 'Ошибка удаления временного файла'"), ПутьКФайлу);
		КонецПопытки;		
	
	КонецЦикла;	
	
КонецПроцедуры

// Вызывается при первоначальном заполнении информационной базы.
//
Процедура ЗаполнитьРазделенныеДанные() Экспорт
			
	// Настройки 
	
	ШиринаВидеоПоУмолчанию = РегистрыСведений.НастройкиЭлектронныхКурсов.Значение("ШиринаВидеоПоУмолчанию");
	
	Если НЕ ЗначениеЗаполнено(ШиринаВидеоПоУмолчанию) Тогда
		РегистрыСведений.НастройкиЭлектронныхКурсов.Сохранить("ШиринаВидеоПоУмолчанию", 640);	
	КонецЕсли;
	
	// Выгружаем обязательные файлы в каталог ресурсов
	
	ПутьКОбщемуКаталогуНаВебСервере = РегистрыСведений.ОбщиеНастройкиЭлектронногоОбучения.Значение("ПутьКОбщемуКаталогуНаВебСервере");
	
	Если ЗначениеЗаполнено(ПутьКОбщемуКаталогуНаВебСервере) Тогда	
		
		ПутьККаталогуЭлектронныхКурсов = ИзучениеЭлектронныхКурсовСлужебный.ПутьККаталогуЭлектронныхКурсов(ПутьКОбщемуКаталогуНаВебСервере);
		ИзучениеЭлектронныхКурсовСлужебныйКлиентСервер.ВыполнитьНачальноеЗаполнениеКаталогаЭлектронныхКурсов(ПутьККаталогуЭлектронныхКурсов);
		
	КонецЕсли;
	
КонецПроцедуры

Функция ВерсияОбработчика(ВерсияБЭО)
	
	ОписаниеВсехПодсистем = ОбщегоНазначения.ОписанияПодсистем();
	ЕстьПодсистемаБЭО = Ложь;
	Для каждого ОписаниеПодсистемы Из ОписаниеВсехПодсистем Цикл
		Если ОписаниеПодсистемы.Имя = "БиблиотекаЭлектронногоОбучения" Тогда
			ЕстьПодсистемаБЭО = Истина;
			Прервать;
		КонецЕсли;
	КонецЦикла;	
	
	Если ЕстьПодсистемаБЭО Тогда		
		
		Возврат ВерсияБЭО;
		
	Иначе
		
		СоответствиеВерсий = Неопределено;
		
		ЭлектронноеОбучениеПереопределяемый.ПриОпределенииСоответствияВерсийОбработчиковОбновлений(СоответствиеВерсий);
		
		Если ТипЗнч(СоответствиеВерсий) <> Тип("Соответствие") Тогда
			
			ВызватьИсключение НСтр("ru = 'При внедрении подсистемы электронного обучения в
			|родительскую подсистему требуется установить соответствие между версией
			|библиотеки электронного обучения и версией родительской подсистемы.'");
			
		КонецЕсли;
		
		ВерсияПотребителя = СоответствиеВерсий.Получить(ВерсияБЭО); 
		
		Если ВерсияПотребителя = Неопределено Тогда
			
			ТекстОшибки = НСтр("ru = 'Не установлено соответствие версии %1 подсистемы электронного обучения
			|и родительской подсистемы.'");						
			ТекстОшибки = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ТекстОшибки, ВерсияБЭО);
			
			ВызватьИсключение ТекстОшибки;
			
		КонецЕсли;
		
		Возврат ВерсияПотребителя;		
			
	КонецЕсли;
	
КонецФункции


// Общие

// Служит для получения ссылки на элемент курса по его имени и идентификатору.
//
// Параметры:
//  ИмяОбъекта - Строка, содержащая имя объекта.
//  id - Строка, содержащая GUID объекта.
//
// Возвращаемое значение:
//  Ссылку на элемент справочника.
//  Неопределено, если объект не найден.
//
Функция СсылкаНаЭлементКурсаПоИдентификатору(ИмяОбъекта, id) Экспорт
	
	Если ПустаяСтрока(id) ИЛИ ПустаяСтрока(ИмяОбъекта) Тогда
		Возврат Неопределено;
	КонецЕсли;	
	
	УникальныйИдентификатор = Новый УникальныйИдентификатор(id);	
	МенеджерСправочника = МенеджерСправочникаПоТипуОбъекта(ИмяОбъекта);	
	СправочникСсылка = МенеджерСправочника.ПолучитьСсылку(УникальныйИдентификатор);
		
	Если ЭлектронноеОбучениеСлужебный.СсылкаСуществуетВБазе(СправочникСсылка) Тогда
		
		Возврат СправочникСсылка;
		
	Иначе
		
		Если ИмяОбъекта = "collection" Тогда
			// Только для совместимости со старыми версиями,
			// когда тип объекта collection использовался для тестов.
			Возврат СсылкаНаЭлементКурсаПоИдентификатору("quiz", id); // Рекурсия
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат Неопределено;
		
КонецФункции

Функция МенеджерСправочникаПоТипуОбъекта(ТипОбъекта)
	
	СоответствиеТипов = Новый Соответствие;
	СоответствиеТипов.Вставить("collection", Справочники.ТеорияЭлектронныхКурсов);
	СоответствиеТипов.Вставить("quiz", Справочники.ЭлектронныеТесты);
	СоответствиеТипов.Вставить("file", Справочники.ЭлементыЭлектронныхРесурсов);
	СоответствиеТипов.Вставить("glossary", Справочники.ЭлектронныеГлоссарии);
	СоответствиеТипов.Вставить("knowledgeBase", Справочники.ЭлектронныеКурсы);
	Если Метаданные.Справочники.Найти("УдалитьТекстыЭлектронныхКурсов") <> Неопределено Тогда
		СоответствиеТипов.Вставить("page", Справочники["УдалитьТекстыЭлектронныхКурсов"]);
	КонецЕсли;
	СоответствиеТипов.Вставить("question", Справочники.ТестовыеВопросы);
	СоответствиеТипов.Вставить("res", Справочники.ЭлектронныеРесурсы);
	СоответствиеТипов.Вставить("term", Справочники.ТерминыЭлектронныхГлоссариев);
	
	Возврат СоответствиеТипов.Получить(ТипОбъекта);	
	
КонецФункции


#КонецОбласти
